supersonic ramp/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 2367;

boundaryField
{
    OUTLET
    {
        type            zeroGradient;
    }

    INLET
    {
        type            fixedValue;
        value           uniform 2367;
    }

    "(WALL|WALL_UP)"
    {
        type            zeroGradient;
    }

    frontAndBackPlanes
    {
        type            empty;
    }

}


// ************************************************************************* //
