supersonic ramp/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Tinlet          107.1;

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $Tinlet;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $Tinlet;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    "(WALL|WALL_UP)"
    {
        type            zeroGradient;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
