supersonic ramp/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.0;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $kInlet;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $kInlet;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    WALL_UP
    {
        type            zeroGradient;
    }

    WALL
    {
        type            kqRWallFunction;
        value           uniform $kInlet;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
