supersonic ramp/0.org/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      1e-5;

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $omegaInlet;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform $omegaInlet;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    WALL_UP
    {
        type            zeroGradient;
    }

    WALL
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }

    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
